In [3]:
import numpy as np 
import pandas as pd

In [5]:
pd.isnull(np.nan)

True

In [9]:
pd.isnull(None)

True

In [11]:
pd.notnull(np.nan)

False

In [15]:
pd.isnull(pd.Series([1,np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [27]:
pd.isnull(pd.DataFrame({
     'A' : [1, np.nan, 4] ,
      'b' : [np.nan, 2,3 ] ,
    'c': [np.nan, 2, np.nan] ,
} ))

       A      b      c
0  False   True   True
1   True  False  False
2  False  False   True

In [29]:
pd.Series([1,2,np.nan]).count()

2

In [6]:
import numpy as np 
import pandas as pd

In [8]:
s= pd.Series([1,2,3,np.nan, 4])

In [10]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [16]:
pd.notnull(s).count()

5

In [14]:
pd.isnull(s).count()

5

In [43]:
pd.notnull(s).sum() # every true value is counted as null

4

In [45]:
pd.isnull(s).sum()

1

In [47]:
 s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
4    4.0
dtype: float64

In [49]:
 s.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [18]:
s[s.isnull()]

3   NaN
dtype: float64

In [51]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
4    4.0
dtype: float64

In [53]:
# droping null values

In [55]:
s.dropna()

0    1.0
1    2.0
2    3.0
4    4.0
dtype: float64

In [61]:
df = pd.DataFrame({
    'a' : [1,np.nan, 30, np.nan] ,
     'b' : [ 2,8,31,np.nan] ,
      'c' : [np.nan, 9, 32, 100 ],
     'd' : [5,8,34,110] ,})

In [63]:
df

      a     b      c    d
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      float64
 1   b       3 non-null      float64
 2   c       3 non-null      float64
 3   d       4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 260.0 bytes

In [67]:
df.isnull()

       a      b      c      d
0  False  False   True  False
1   True  False  False  False
2  False  False  False  False
3   True   True  False  False

In [69]:
df.isnull().sum()

a    2
b    1
c    1
d    0
dtype: int64

In [77]:
df.dropna()  # Rows containing atleast one null value willbe dropped

      a     b     c   d
2  30.0  31.0  32.0  34

In [81]:
df.dropna(axis =1) # the axis is switched from 0 to 1 
# ie columns containig atleas one null value will be deleted

     d
0    5
1    8
2   34
3  110

In [83]:
df.dropna(how='all') # if all elements of the row are null then only droped

      a     b      c    d
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [87]:
df.dropna(how= 'any')

      a     b     c   d
2  30.0  31.0  32.0  34

In [89]:
df

      a     b      c    d
0   1.0   2.0    NaN    5
1   NaN   8.0    9.0    8
2  30.0  31.0   32.0   34
3   NaN   NaN  100.0  110

In [95]:
df.dropna(thresh =3) # thresh parameteere to indicate a threshodld (a miinimum number) of non-null values for the row/column to be kept

      a     b     c   d
0   1.0   2.0   NaN   5
1   NaN   8.0   9.0   8
2  30.0  31.0  32.0  34

In [97]:
df.dropna(thresh= 3, axis= 'columns')

      b      c    d
0   2.0    NaN    5
1   8.0    9.0    8
2  31.0   32.0   34
3   NaN  100.0  110

In [99]:
 # filling null values

In [101]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    4.0
dtype: float64

In [103]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    4.0
dtype: float64

In [109]:
 s.fillna(method = 'ffill') # forward fill . i.e the above number is forwarded to the null

C:\Users\udayk\AppData\Local\Temp\ipykernel_33296\2675926179.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  s.fillna(method = 'ffill') # forward fill . i.e the above number is forwarded to the null

0    1.0
1    2.0
2    3.0
3    3.0
4    4.0
dtype: float64

In [117]:
  s.fillna(obj.bfill()) #backward fill

NameError: name 'obj' is not defined

In [119]:
pd.Series([np.nan, 3, np.nan, 9]) . fillna(method ='ffill')

C:\Users\udayk\AppData\Local\Temp\ipykernel_33296\127422200.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  pd.Series([np.nan, 3, np.nan, 9]) . fillna(method ='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [20]:
df.fillna({'A' : 0 , 'b' :99 , 'c' : df['c'].mean()})

NameError: name 'df' is not defined

In [123]:
df.fillna(method='ffill',axis=0)

C:\Users\udayk\AppData\Local\Temp\ipykernel_33296\2614524743.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill',axis=0)

      a     b      c    d
0   1.0   2.0    NaN    5
1   1.0   8.0    9.0    8
2  30.0  31.0   32.0   34
3  30.0  31.0  100.0  110

In [125]:
df.fillna(method= 'ffill' , axis =1)

C:\Users\udayk\AppData\Local\Temp\ipykernel_33296\1123844822.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method= 'ffill' , axis =1)

      a     b      c      d
0   1.0   2.0    2.0    5.0
1   NaN   8.0    9.0    8.0
2  30.0  31.0   32.0   34.0
3   NaN   NaN  100.0  110.0